app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "categories" SET "name" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["name", "Kitchen Knives"], ["updated_at", "2020-06-18 07:08:29.981040"], ["id", 7]]
---
  def update

    @category = Category.find(params[:id])
    @category.update(category_params)

INSERT INTO "categories" ("name", "parent_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Mobile"], ["parent_id", 1], ["created_at", "2020-06-18 07:00:15.823703"], ["updated_at", "2020-06-18 07:00:15.823703"]]
---
  def create

    @category= Category.new(category_params)
    @category.save