app/controllers/products_controller.rb

SELECT "categories".* FROM "categories" ORDER BY "categories"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def index
    @categories = Category.all