app/controllers/products_controller.rb

INSERT INTO "products" ("name", "description", "price", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Note 10 "], ["description", "note 10 "], ["price", 200000.0], ["category_id", 4], ["created_at", "2020-06-18 11:13:35.094689"], ["updated_at", "2020-06-18 11:13:35.094689"]]
---
  def create

    @product = Product.new(product_params)
    @product.save

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]
UPDATE "products" SET "name" = ?, "description" = ?, "category" = ?, "sub_category" = ?, "price" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["name", "8"], ["description", "6"], ["category", 6], ["sub_category", 6], ["price", 6.0], ["updated_at", "2020-06-17 05:01:06.245224"], ["id", 16]]
---
  def update
    @product = Product.find(params[:id])
    @product.update(product_params)