app/views/categories/new.html.erb

SELECT "categories".* FROM "categories" WHERE "categories"."parent_id" = ?  [["parent_id", nil]]
---

<%= f.collection_select :parent_id, Category.where(parent_id: nil) , :id, :name , include_blank: true %>