app/views/categories/show.html.erb


<% @categories = Category.all%>
---
SELECT "categories".* FROM "categories"