app/views/products/edit.html.erb

    <%= f.label :Categories %><br>
    <%= f.collection_select :category_id, Category.all , :id, :name , include_blank: true %>
---
SELECT "categories".* FROM "categories"