app/views/products/new.html.erb

    <%= f.label :SubCategory %><br>
    <%= f.collection_select :sub_category, Category.where.not(parent_id: nil) , :id, :name , include_blank: true %>
---
SELECT "categories".* FROM "categories" WHERE "categories"."parent_id" IS NOT NULL